In [60]:
import numpy as np

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([['A231', 'Book', 5, 3, 150], 
                   ['M441', 'Magic Staff', 10, 7, 200]],
                   columns = ['Code', 'Name', 'Price', 'Net', 'Sales'])

In [3]:
df

   Code         Name  Price  Net  Sales
0  A231         Book      5    3    150
1  M441  Magic Staff     10    7    200

In [4]:
df = pd.DataFrame([['A231', 'Book', 5, 3, 150], 
                   ['M441', 'Magic Staff', 10, 7, 200]])

In [5]:
df

      0            1   2  3    4
0  A231         Book   5  3  150
1  M441  Magic Staff  10  7  200

In [6]:
df.columns = ['Code', 'Name', 'Price', 'Net', 'Sales']

In [7]:
df

   Code         Name  Price  Net  Sales
0  A231         Book      5    3    150
1  M441  Magic Staff     10    7    200

In [8]:
df = pd.DataFrame([['A231', 'Book', 5, 3, 150], 
                   ['M441', 'Magic Staff', 10, 7, 200]],
                   columns = ['Code', 'Name', 'Price', 'Net', 'Sales'])

In [9]:
df

   Code         Name  Price  Net  Sales
0  A231         Book      5    3    150
1  M441  Magic Staff     10    7    200

In [10]:
f =['file:///D:/hiten%20pan%20card.png']

In [11]:
f

['file:///D:/hiten%20pan%20card.png']

In [12]:
df = pd.DataFrame([['A231', 'Book', 5, 3, 150,4], 
                   ['M441', 'Magic Staff', 10, 7, 200,f]],
                   columns = ['Code', 'Name', 'Price', 'Net', 'Sales','pic'])
f =['file:///D:/hiten%20pan%20card.png']

In [13]:
df

   Code         Name  Price  Net  Sales                                  pic
0  A231         Book      5    3    150                                    4
1  M441  Magic Staff     10    7    200  [file:///D:/hiten%20pan%20card.png]

In [14]:
df1 = pd.DataFrame([['A231', 'Book', 5, 3, 150], 
                   ['M481', 'Magic Staff', 10, 7, 200],
                   ['M491', 'Staff', 10, 9, 280],
                   ['M431', 'Note Staff', 10, 45, 650]],
                   columns = ['Code', 'Name', 'Price', 'Net', 'Sales'])

In [15]:
df2= pd.DataFrame([['A231', 'delhi', 60], 
                   ['M481', 'noida', 56],
                   ['M491', 'gurgram', 65],
                   ['M431', 'kerala', 54]],
                   columns = ['Code', 'Place', 'Pieces'])

In [16]:
df1

   Code         Name  Price  Net  Sales
0  A231         Book      5    3    150
1  M481  Magic Staff     10    7    200
2  M491        Staff     10    9    280
3  M431   Note Staff     10   45    650

In [17]:
df2

   Code    Place  Pieces
0  A231    delhi      60
1  M481    noida      56
2  M491  gurgram      65
3  M431   kerala      54

In [18]:
pd.merge(df1 ,df2 ,how = 'inner', on = 'Code')

   Code         Name  Price  Net  Sales    Place  Pieces
0  A231         Book      5    3    150    delhi      60
1  M481  Magic Staff     10    7    200    noida      56
2  M491        Staff     10    9    280  gurgram      65
3  M431   Note Staff     10   45    650   kerala      54

In [19]:
pd.merge(df1,df2,how='inner')

   Code         Name  Price  Net  Sales    Place  Pieces
0  A231         Book      5    3    150    delhi      60
1  M481  Magic Staff     10    7    200    noida      56
2  M491        Staff     10    9    280  gurgram      65
3  M431   Note Staff     10   45    650   kerala      54

In [20]:
dataframe = pd.DataFrame([['as','de','ot','rr','pe'],
                         ['sw','er','rt','gh','op'],
                         ['fg','ew','fr','uy','yh']],
                         columns = ['one','two','three','four','five'])

In [21]:
dataframe

  one two three four five
0  as  de    ot   rr   pe
1  sw  er    rt   gh   op
2  fg  ew    fr   uy   yh

In [22]:
dataframe.loc[1]

one      sw
two      er
three    rt
four     gh
five     op
Name: 1, dtype: object

In [23]:
dataframe.set_index('one')

    two three four five
one
as   de    ot   rr   pe
sw   er    rt   gh   op
fg   ew    fr   uy   yh

In [24]:
dataframe.loc[2]

one      fg
two      ew
three    fr
four     uy
five     yh
Name: 2, dtype: object

In [25]:
df1

   Code         Name  Price  Net  Sales
0  A231         Book      5    3    150
1  M481  Magic Staff     10    7    200
2  M491        Staff     10    9    280
3  M431   Note Staff     10   45    650

In [26]:
df1.describe()

       Price        Net       Sales
count   4.00   4.000000    4.000000
mean    8.75  16.000000  320.000000
std     2.50  19.493589  226.421436
min     5.00   3.000000  150.000000
25%     8.75   6.000000  187.500000
50%    10.00   8.000000  240.000000
75%    10.00  18.000000  372.500000
max    10.00  45.000000  650.000000

In [27]:
df1

   Code         Name  Price  Net  Sales
0  A231         Book      5    3    150
1  M481  Magic Staff     10    7    200
2  M491        Staff     10    9    280
3  M431   Note Staff     10   45    650

In [28]:
df2

   Code    Place  Pieces
0  A231    delhi      60
1  M481    noida      56
2  M491  gurgram      65
3  M431   kerala      54

In [29]:
df1

   Code         Name  Price  Net  Sales
0  A231         Book      5    3    150
1  M481  Magic Staff     10    7    200
2  M491        Staff     10    9    280
3  M431   Note Staff     10   45    650

In [30]:
df2

   Code    Place  Pieces
0  A231    delhi      60
1  M481    noida      56
2  M491  gurgram      65
3  M431   kerala      54

In [31]:
pd.concat([df1,df2])

   Code         Name  Price   Net  Sales    Place  Pieces
0  A231         Book    5.0   3.0  150.0      NaN     NaN
1  M481  Magic Staff   10.0   7.0  200.0      NaN     NaN
2  M491        Staff   10.0   9.0  280.0      NaN     NaN
3  M431   Note Staff   10.0  45.0  650.0      NaN     NaN
0  A231          NaN    NaN   NaN    NaN    delhi    60.0
1  M481          NaN    NaN   NaN    NaN    noida    56.0
2  M491          NaN    NaN   NaN    NaN  gurgram    65.0
3  M431          NaN    NaN   NaN    NaN   kerala    54.0

In [32]:
for x in range(0,10):
    if x>5:
        print (x)

6
7
8
9

In [33]:
for x in range(0,11):
    print(x)

0
1
2
3
4
5
6
7
8
9
10

In [34]:
range(0,10)

range(0, 10)

In [35]:
list = [range(0,5)]

In [36]:
list

[range(0, 5)]

In [37]:
hi =  []
for b in range(0,8):
    hi.append(b)
    
print(hi)

[0, 1, 2, 3, 4, 5, 6, 7]

In [38]:
lst = []
for num in range(1,101):
    if num % 2 ==0:
        lst.append(num)
print(lst)

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100]

In [39]:
def check_even(num_list):
    even = []
    for num in num_list:
        if  num  % 2 == 0:
            even.append(num)
        else:
            pass
    return even

In [40]:
check_even([4,6,5,8,7,9,6])

[4, 6, 8, 6]

In [41]:
df1

   Code         Name  Price  Net  Sales
0  A231         Book      5    3    150
1  M481  Magic Staff     10    7    200
2  M491        Staff     10    9    280
3  M431   Note Staff     10   45    650

In [42]:
df1['Net'].max()

45

In [43]:
df1['Sales'].max()

650

In [44]:
df1['Code'].max()

'M491'

In [45]:
df1['Sales'].max()

650

In [46]:
df1['Price'] = df1['Price'].drop_duplicates()

In [47]:
df1['Price'] = [45,65,65,45]

In [48]:
df1['xyz'] = [65,88,63,75]

In [49]:
df1

   Code         Name  Price  Net  Sales  xyz
0  A231         Book     45    3    150   65
1  M481  Magic Staff     65    7    200   88
2  M491        Staff     65    9    280   63
3  M431   Note Staff     45   45    650   75

In [50]:
df1

   Code         Name  Price  Net  Sales  xyz
0  A231         Book     45    3    150   65
1  M481  Magic Staff     65    7    200   88
2  M491        Staff     65    9    280   63
3  M431   Note Staff     45   45    650   75

In [51]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Code    4 non-null      object
 1   Name    4 non-null      object
 2   Price   4 non-null      int64
 3   Net     4 non-null      int64
 4   Sales   4 non-null      int64
 5   xyz     4 non-null      int64
dtypes: int64(4), object(2)
memory usage: 320.0+ bytes

In [55]:
df1['Price'].astype(float)

0    45.0
1    65.0
2    65.0
3    45.0
Name: Price, dtype: float64

In [56]:
df1['Price'] = df1['Price'].astype(float)

In [57]:
df1

   Code         Name  Price  Net  Sales  xyz
0  A231         Book   45.0    3    150   65
1  M481  Magic Staff   65.0    7    200   88
2  M491        Staff   65.0    9    280   63
3  M431   Note Staff   45.0   45    650   75

In [58]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Code    4 non-null      object
 1   Name    4 non-null      object
 2   Price   4 non-null      float64
 3   Net     4 non-null      int64
 4   Sales   4 non-null      int64
 5   xyz     4 non-null      int64
dtypes: float64(1), int64(3), object(2)
memory usage: 320.0+ bytes

In [61]:
df1['Net'].astype(np.uint8)

0     3
1     7
2     9
3    45
Name: Net, dtype: uint8

In [62]:
df1

   Code         Name  Price  Net  Sales  xyz
0  A231         Book   45.0    3    150   65
1  M481  Magic Staff   65.0    7    200   88
2  M491        Staff   65.0    9    280   63
3  M431   Note Staff   45.0   45    650   75

In [64]:
from datetime import datetime

In [66]:
datetime.now()

datetime.datetime(2022, 5, 19, 22, 46, 11, 552238)

In [68]:
for num in range(10):
    if num>5:
        print(num)

6
7
8
9

In [69]:
def summ(a,b):
    return (a+b)

In [70]:
summ(6,8)

14

In [74]:
def n(i):
    i =  input()
    return i

In [80]:
def smaller_num(x,y):

    if x>y:
        number= y
    else:
        number= x
    return number


x = input("Enter first number:-")

y = input("Enter second number:-")

smaller = smaller_num(x,y)

print("The smaller number between " +  str(x) + " and " + str(y) + " is " + str(smaller))

Enter first number:-4
Enter second number:-9
The smaller number between 4 and 9 is 4

In [99]:
a = input("1st no : ")
b = input("2nd no : ")

def aa(a,b):
    return a+b


print(int(aa(a,b)))

1st no : 4
2nd no : 4
44

In [96]:
aa(5,5)

10

In [6]:
200000*5/5/5/5/5/5/5/2/2/2

8.0

In [48]:
n=3
for i in range(n):
    for j in range(i,n-1):
        print(" "*len("sudh"), end =" ")
    for j in range(i+1):
        print("sudh",end=" ")
    for j in range(i):
        print("sudh",end=" ")
    print()

          sudh
     sudh sudh sudh
sudh sudh sudh sudh sudh

In [6]:
t = (3,23,45,67,2,4,5,6)

In [7]:
for i in range(len(t)):
    print (i,t[i])

0 3
1 23
2 45
3 67
4 2
5 4
6 5
7 6

In [10]:
for i in range(len(t)):
    print (t[i])

3
23
45
67
2
4
5
6

In [23]:
s= "ineuron"
for i in range(len(s)):
    print(i,s[i])

0 i
1 n
2 e
3 u
4 r
5 o
6 n

In [21]:
s[::-1]

'norueni'

In [28]:
s= "ineuron"
for i in range(len(s)-1,-1,-1):
    print(i,s[i])

6 n
5 o
4 r
3 u
2 e
1 n
0 i

In [29]:
l = ["sudh","kumar",68464,"fbddbf",542,655]

In [31]:
l[2]

68464

In [32]:
l1=[]
for i in l:
    if type(i) == int:
        l1.append(i)

In [33]:
l1

[68464, 542, 655]

In [34]:
d = {1:3345345,"name":"sudh","email_id": "sudhanshu@ineuron.ai",234:"fsffdddsf","43":"sfsaf",234:"3454"}

In [35]:
d1=[]
for i in d:
    if  type(i) == int:
        d1.append(i)

In [36]:
d1

[1, 234]

In [44]:
t=("sss","sdf",[1,5,3,6,8],(1,2,56,3,5,5),{"key1":"sudh","key2":"kunar"})

In [45]:
t[3][3]

3

In [46]:
for i in t:
    if type(i) == list or type(i) == tuple:
        for j in i :
            if j == 3:
                print (j)

3
3

In [63]:
n=3
for i in range(n):
    for j in range(i,n-1):
        print(" "*len("sudh"), end =" ")
    for j in range(i+1):
        print("sudh",end=" ")
    for j in range(i):
        print("sudh",end=" ")
    print()

          sudh
     sudh sudh sudh
sudh sudh sudh sudh sudh

In [53]:
list(range(0,5))

[0, 1, 2, 3, 4]

In [60]:
print("sudhbb",65,end="f")

sudhbb 65f

In [70]:
n=3
for i in range(n):
    print("5"*len("sudh"), end =" ")

5555 5555 5555

In [5]:
a = 1
b = 10

while a <= b:
    a = a+1
    print(a)

2
3
4
5
6
7
8
9
10
11

In [7]:
a = 1
b = 10
while a<b:
    a=a+1
    if a==3:
        continue
    print(a)

2
4
5
6
7
8
9
10

In [8]:
l = [1,2,3,6,9,8,5,6,5]

In [9]:
for i in l:
    print (i)

1
2
3
6
9
8
5
6
5

In [13]:
a = 0
while a < len(l):
    print(l[a])
    a = a+1

1
2
3
6
9
8
5
6
5

In [19]:
print(l[2])

3

In [20]:
t = (3,4,5,6,7,8,9)

In [27]:
b = 0
while b < len(t):
    if t[b] == 6 or t[b] == 7:
        print (b)
    b = b + 1

3
4

In [30]:
i = -1
while i>= -len(t):
    if t[i]==6 or t[i] ==  7:
        print (i)
    i  = i-1

-3
-4

In [31]:
d = {'k1':"sudh","k2":[1,2,3,4] , "k3" : (2,3,4,5)}

In [33]:
d

{'k1': 'sudh', 'k2': [1, 2, 3, 4], 'k3': (2, 3, 4, 5)}

In [35]:
len(d)

3

In [37]:
a = 0
b = list(d.keys())
while a < len (d):
    print (d[b[a]])
    
    a = a+1

sudh
[1, 2, 3, 4]
(2, 3, 4, 5)

In [40]:
d[b[1]]

[1, 2, 3, 4]

In [41]:
type(list)

type

In [42]:
def su(a,b):
    return a+b

In [47]:
def test():
    return "this is function"

In [48]:
test()

'this is function'

In [50]:
type(test())

str

In [ ]:
a = 1
b = 10

while a <= b:
    a = a+1
    print(a)